#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-04-30T18:24:02Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:445131834497:v1o7d57660/" -> (known after apply)
      ~ id            = "dlyttd" -> (known after apply)
      ~ invoke_url    = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-04-30T18:24:02Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "dlyttd" -> (known after apply)
        id                    = "ags-v1o7d57660-demo"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.in_app_metrics.aws_cloudwatch_metric_alarm.backoff_retry_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "backoff_retry_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the save_metrics lambda" -> "This metric monitors average duration for the backoff_retry lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "save-metrics" -> "backoff_retry"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*